class MessagesText:
    def placeholders_to_information(self,msg:str, placeholders_and_infromation:list) -> str:
        for x in placeholders_and_infromation:
            msg=msg.replace(str(x[0]), str(x[1]))
        return msg

    mute_command_message = ('Користувач $USER$ переведений в режим RO(Read Only)\n'
                            #'\u2022 <b>Причина:</b> $REASON$\n'
                            '\u2023 <b>До</b>: $EXP_DATE$\n'
                            '\u2022 <i><b>Адміністратор</b></i>: $ADMIN_NAME$')
    unmute_command_message = ('Користувач $USER$ виведений з RO\n'
                            '\u2022 <i><b>Адміністратор</b></i>: $ADMIN_NAME$')

    profile_message = ("📌 <b>Профіль користувача $USER$</b>\n\n"
                       "❤️ Репутація: <i>$REP$</i>")

    start_message = ("Це офіційний бот чату UARO: Ukrainian Аmateur Radio Operators\n"
                     '<a href="https://t.me/Ukraine_Amateur_Radio_Operators">Натисни сюди для вступу</a>\n'
                     '<a href="https://telegra.ph/Bot-UARO-komandi-ta-%D1%96nformac%D1%96ya-06-07">Команди, інформація</a>')
    user_dont_muted = "Користувач не в RO"
    user_not_found = "Неможливо знайти користувача!"
    incorrect_command = "Неправильно введена команда!"


    sell_start_message = ("При створенні оголошення діють правила, порушення яких веде до відхилення заявок або блокування створення оголошень користувачем.\n"
                        "Відносіться відповідально до створення заявки, дотримуйтесь правил і не зловживайте наданими вам можливостями.\n"
                          "Правила барахолки:\n"
                        "1. Обов'язкові дані: фото(не більше 5), опис, ціна. Пишіть грамотно!\n"
                        "2. Оновлюючи оголошення, видаляйте попередню публікацію. Оновлення — не частіше ніж раз на 7 днів або зі зниженням ціни.\n"
                        "3. Обговорення оголошення — у приватних повідомленнях.\n"
                        "4. З початком нового календарного місяця автоматично видаляються оголошення, опубліковані раніше ніж за місяць до нього. Приклад: 1 січня — оголошення, опубліковані у грудні, залишаються. Опубліковані раніше 1 грудня — видаляються.\n"
                        "5. Допускається використання лише живих фото лоту.\n"
                        "6. Заборонений дропшипінг та комерція без погодження з адміністрацією.\n"
                        "7. В кінці оголошення обов'язково додавайте хештег в залежності від пропозиції: #куплю або #продам\n"
                        "️Адміністрація залишає за собою право видаляти оголошення без попередження.\n"
                          "Нижче буде надіслано приклад правильно створеного оголошення")
    sell_start_message_2 = "Тепер надішліть ТІЛЬКИ ФОТО які будуть в оголошенні, по одному:"

    sell_bad_ad = ("Оголошення відхилено!\n"
                   "Відсутній текст або фото, попробуйте ще раз.")

    def sell_accept(self, username):
        return ("Ваше оголошення одобрено.\n"
           f"Адміністратор: {username}")

    def sell_deny(self, username):
        return ("Вашу заявку відхилено!\n"
                f"Адміністратор: {username}")

    conversation_with_admin_start = ('Ви відкрили чат спілкування з адміністрацією\n'
                                     'Поки триває чат, використання інших команд буде призупинено\n'
                                     'Любе наступне ваше повідомлення буде надіслано адміністрації до закриття чату\n'
                                     'Навіть після закриття чату, адміністратор зможе відповісти на ваше повідомлення')
